{"id": "rad_001", "content": "The lungs are clear bilaterally with no focal consolidation, pleural effusion, or pneumothorax. No evidence of acute pulmonary disease.", "source": "radiology_findings", "category": "normal_lungs"}
{"id": "rad_002", "content": "The cardiac silhouette is within normal limits. The cardiomediastinal and hilar contours are unremarkable. No cardiomegaly is present.", "source": "radiology_findings", "category": "normal_cardiac"}
{"id": "rad_003", "content": "Mild bibasilar atelectasis is noted without associated consolidation. This likely represents subsegmental collapse without active infiltrate.", "source": "radiology_findings", "category": "atelectasis"}
{"id": "rad_004", "content": "There is blunting of the bilateral costophrenic angles consistent with small pleural effusions. No large effusion or loculation is identified.", "source": "radiology_findings", "category": "pleural_effusion"}
{"id": "rad_005", "content": "Focal consolidation in the right lower lobe with air bronchograms present. Findings are consistent with pneumonia. Clinical correlation is recommended.", "source": "radiology_findings", "category": "pneumonia"}
{"id": "rad_006", "content": "Diffuse bilateral interstitial opacities are present, consistent with pulmonary edema. The cardiac silhouette is enlarged suggesting cardiac decompensation.", "source": "radiology_findings", "category": "pulmonary_edema"}
{"id": "rad_007", "content": "Hyperinflation of the lungs with flattening of the hemidiaphragms and increased retrosternal airspace. Findings are consistent with chronic obstructive pulmonary disease (COPD).", "source": "radiology_findings", "category": "copd"}
{"id": "rad_008", "content": "A well-defined nodule measuring approximately 2.5 cm is noted in the right upper lobe. Recommend CT chest for further characterization and to exclude malignancy.", "source": "radiology_findings", "category": "lung_nodule"}
{"id": "rad_009", "content": "The mediastinum is widened with prominence of the aortic contour. This may represent aortic tortuosity or aneurysmal dilatation. Further imaging with CT is recommended.", "source": "radiology_findings", "category": "mediastinal_abnormality"}
{"id": "rad_010", "content": "No acute osseous abnormality identified. The visualized ribs, clavicles, and shoulders appear intact without fracture or dislocation.", "source": "radiology_findings", "category": "normal_bones"}
{"id": "rad_011", "content": "Pneumothorax is present on the right with partial collapse of the right lung. The visceral pleural line is clearly identified. No tension physiology is evident.", "source": "radiology_findings", "category": "pneumothorax"}
{"id": "rad_012", "content": "Retrocardiac opacity is noted, which may represent lower lobe pneumonia or atelectasis. Lateral view would be helpful for further evaluation.", "source": "radiology_findings", "category": "retrocardiac_opacity"}
{"id": "rad_013", "content": "Elevation of the right hemidiaphragm is present. This may be due to diaphragmatic paralysis, subphrenic abscess, or hepatomegaly. Clinical correlation is suggested.", "source": "radiology_findings", "category": "elevated_hemidiaphragm"}
{"id": "rad_014", "content": "Calcified granulomas are noted in both lung fields, likely representing old healed infection such as tuberculosis or histoplasmosis. No active disease is present.", "source": "radiology_findings", "category": "granulomas"}
{"id": "rad_015", "content": "Cardiomegaly is present with cardiothoracic ratio exceeding 0.5. This suggests cardiac enlargement, possibly due to heart failure, valvular disease, or cardiomyopathy.", "source": "radiology_findings", "category": "cardiomegaly"}
{"id": "rad_016", "content": "Bilateral hilar lymphadenopathy is present with symmetric enlargement. Differential diagnosis includes sarcoidosis, lymphoma, or tuberculosis. Clinical history and further workup are needed.", "source": "radiology_findings", "category": "hilar_lymphadenopathy"}
{"id": "rad_017", "content": "Ground-glass opacities are seen in a peripheral distribution bilaterally. In the appropriate clinical context, this may represent viral pneumonia, including COVID-19, or organizing pneumonia.", "source": "radiology_findings", "category": "ground_glass_opacities"}
{"id": "rad_018", "content": "Honeycombing and reticular opacities predominantly in the lower lobes consistent with pulmonary fibrosis. This pattern is typical of usual interstitial pneumonia (UIP).", "source": "radiology_findings", "category": "pulmonary_fibrosis"}
{"id": "rad_019", "content": "A cavitary lesion is identified in the left upper lobe with thick irregular walls. Differential includes necrotizing infection (tuberculosis, fungal) or cavitary malignancy.", "source": "radiology_findings", "category": "cavitary_lesion"}
{"id": "rad_020", "content": "Free air is seen under the right hemidiaphragm on the upright chest radiograph. This is consistent with pneumoperitoneum and suggests bowel perforation. Urgent surgical consultation is recommended.", "source": "radiology_findings", "category": "pneumoperitoneum"}
{"id": "clin_001", "content": "Shortness of breath (dyspnea) can result from multiple etiologies including cardiac (heart failure, myocardial infarction), pulmonary (pneumonia, COPD, asthma, pulmonary embolism), or systemic causes (anemia, anxiety).", "source": "clinical_knowledge", "category": "symptom_dyspnea"}
{"id": "clin_002", "content": "Fever with respiratory symptoms raises suspicion for infectious processes such as pneumonia, bronchitis, or viral upper respiratory infection. Consider bacterial versus viral etiology.", "source": "clinical_knowledge", "category": "fever_respiratory"}
{"id": "clin_003", "content": "Chest pain associated with dyspnea may indicate acute coronary syndrome, pulmonary embolism, pneumothorax, or musculoskeletal pain. EKG and cardiac biomarkers are important in evaluation.", "source": "clinical_knowledge", "category": "chest_pain"}
{"id": "clin_004", "content": "Hemoptysis (coughing up blood) suggests pulmonary pathology such as bronchitis, tuberculosis, lung cancer, or pulmonary embolism. Bronchoscopy may be indicated for persistent or massive hemoptysis.", "source": "clinical_knowledge", "category": "hemoptysis"}
{"id": "clin_005", "content": "Chronic cough lasting more than 8 weeks can be due to postnasal drip, asthma, gastroesophageal reflux disease (GERD), or chronic bronchitis. Chest X-ray helps exclude serious pathology.", "source": "clinical_knowledge", "category": "chronic_cough"}
{"id": "clin_006", "content": "In elderly patients with acute onset dyspnea and fever, consider community-acquired pneumonia as a primary diagnosis. Risk stratification using CURB-65 score helps determine need for hospitalization.", "source": "clinical_knowledge", "category": "elderly_pneumonia"}
{"id": "clin_007", "content": "Wheezing is characteristic of obstructive airway diseases such as asthma and COPD. However, unilateral wheezing may suggest foreign body aspiration or bronchial obstruction from tumor.", "source": "clinical_knowledge", "category": "wheezing"}
{"id": "clin_008", "content": "Pulmonary edema typically presents with dyspnea, orthopnea, and bilateral crackles on auscultation. Chest X-ray shows bilateral interstitial and alveolar opacities, often with Kerley B lines.", "source": "clinical_knowledge", "category": "pulmonary_edema_clinical"}
{"id": "clin_009", "content": "Pneumothorax classically presents with sudden onset chest pain and dyspnea. Physical exam may reveal decreased breath sounds and hyperresonance on the affected side.", "source": "clinical_knowledge", "category": "pneumothorax_clinical"}
{"id": "clin_010", "content": "Tuberculosis should be considered in patients with chronic cough, weight loss, night sweats, and fever, particularly in endemic areas or immunocompromised patients. Acid-fast bacilli staining and culture are diagnostic.", "source": "clinical_knowledge", "category": "tuberculosis"}
